//SAMPLE JOB (*),"TESTING JOB",CLASS=A,PRTY=10,NOTIFY=&SYSUID, 
//   MSGCLASS=X,MSGLEVEL=(1,1),TYPRUN=SCAN, 
//   TIME=(3,0),REGION=0M   
//LISTUSER  EXEC PGM=IKJEFT01  
//SYSTSPRT  DD SYSOUT=A,HOLD=YES 
//SYSTSIN   DD *
 LU IBMUSER
// 
