//SAMPLE1 JOB (*),"TESTING JOB",CLASS=A,PRTY=10,NOTIFY=&SYSUID,
//   MSGCLASS=X,MSGLEVEL=(1,1),TYPRUN=SCAN,REGION=0M
//* LIST A USER
//IKJEFT  EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
 LU IBMUSER
//