01 COBOL-TEST-RECORD.
  05 COBOL-TEST-USAGES.
    10 COBOL-4-COMP PIC S9(4) COMP.
    10 COBOL-8-COMP PIC S9(8) COMP.
    10 COBOL-9-COMP PIC S9(9) COMP.
    10 COBOL-4-COMP2 PIC S9(4) COMP-2.
    10 COBOL-7-COMP2 PIC 9(7) COMP-2.
