       PROGRAM-ID. blank-terminal.

       DATA DIVISION.
       SCREEN SECTION.
       01  blank-screen BLANK SCREEN.

       PROCEDURE DIVISION.
           DISPLAY blank-screen

           GOBACK
           .
